### Chicago Public Schools - Progress Report Cards (2011-2012)

Load the pandas and SQLite libraries and establish a connection to FinalDB.db

In [1]:
import pandas as pd
import sqlite3, csv

In [2]:
conn = sqlite3.connect("FinalDB.db")
cur = conn.cursor()

Load the SQL magic module

In [3]:
%load_ext sql

Use Pandas to load the data available in the links above to dataframes. Use these dataframes to load data on the database. FinalDB.db as required tables.

**Note:** uncomment to load datasets in database.

In [4]:
# df = pd.read_csv("ChicagoCensusData.csv")
# df.to_sql("CENSUS_DATA", conn, index=False, if_exists='replace', method='multi')

In [5]:
# df = pd.read_csv("ChicagoPublicSchools.csv")
# df.to_sql("CHICAGO_PUBLIC_SCHOOLS", conn, index=False, if_exists='replace', method='multi')

In [6]:
# df = pd.read_csv("ChicagoCrimeData.csv")
# df.to_sql("CHICAGO_CRIME_DATA", conn, index=False, if_exists='replace', method='multi')

In [7]:
%sql sqlite:///FinalDB.db

In [8]:
%sql select name from sqlite_master where type="table";

 * sqlite:///FinalDB.db
Done.

[('CENSUS_DATA',), ('CHICAGO_PUBLIC_SCHOOLS',), ('CHICAGO_CRIME_DATA',)]

In [9]:
%sql select count(name) from PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS');

 * sqlite:///FinalDB.db
Done.

[(78,)]

In [10]:
%sql select name, type, length(type) from PRAGMA_TABLE_INFO('CHICAGO_PUBLIC_SCHOOLS');

 * sqlite:///FinalDB.db
Done.

[('School_ID', 'INTEGER', 7),
 ('NAME_OF_SCHOOL', 'TEXT', 4),
 ('Elementary, Middle, or High School', 'TEXT', 4),
 ('Street_Address', 'TEXT', 4),
 ('City', 'TEXT', 4),
 ('State', 'TEXT', 4),
 ('ZIP_Code', 'INTEGER', 7),
 ('Phone_Number', 'TEXT', 4),
 ('Link', 'TEXT', 4),
 ('Network_Manager', 'TEXT', 4),
 ('Collaborative_Name', 'TEXT', 4),
 ('Adequate_Yearly_Progress_Made_', 'TEXT', 4),
 ('Track_Schedule', 'TEXT', 4),
 ('CPS_Performance_Policy_Status', 'TEXT', 4),
 ('CPS_Performance_Policy_Level', 'TEXT', 4),
 ('HEALTHY_SCHOOL_CERTIFIED', 'TEXT', 4),
 ('Safety_Icon', 'TEXT', 4),
 ('SAFETY_SCORE', 'REAL', 4),
 ('Family_Involvement_Icon', 'TEXT', 4),
 ('Family_Involvement_Score', 'TEXT', 4),
 ('Environment_Icon', 'TEXT', 4),
 ('Environment_Score', 'REAL', 4),
 ('Instruction_Icon', 'TEXT', 4),
 ('Instruction_Score', 'REAL', 4),
 ('Leaders_Icon', 'TEXT', 4),
 ('Leaders_Score', 'TEXT', 4),
 ('Teachers_Icon', 'TEXT', 4),
 ('Teachers_Score', 'TEXT', 4),
 ('Parent_Engagement_Icon', 'TEXT', 4),
 ('Parent_Engagement_Score', 'TEXT', 4),
 ('Parent_Environment_Icon', 'TEXT', 4),
 ('Parent_Environment_Score', 'TEXT', 4),
 ('AVERAGE_STUDENT_ATTENDANCE', 'TEXT', 4),
 ('Rate_of_Misconducts__per_100_students_', 'REAL', 4),
 ('Average_Teacher_Attendance', 'TEXT', 4),
 ('Individualized_Education_Program_Compliance_Rate', 'TEXT', 4),
 ('Pk_2_Literacy__', 'TEXT', 4),
 ('Pk_2_Math__', 'TEXT', 4),
 ('Gr3_5_Grade_Level_Math__', 'TEXT', 4),
 ('Gr3_5_Grade_Level_Read__', 'TEXT', 4),
 ('Gr3_5_Keep_Pace_Read__', 'TEXT', 4),
 ('Gr3_5_Keep_Pace_Math__', 'TEXT', 4),
 ('Gr6_8_Grade_Level_Math__', 'TEXT', 4),
 ('Gr6_8_Grade_Level_Read__', 'TEXT', 4),
 ('Gr6_8_Keep_Pace_Math_', 'TEXT', 4),
 ('Gr6_8_Keep_Pace_Read__', 'TEXT', 4),
 ('Gr_8_Explore_Math__', 'TEXT', 4),
 ('Gr_8_Explore_Read__', 'TEXT', 4),
 ('ISAT_Exceeding_Math__', 'REAL', 4),
 ('ISAT_Exceeding_Reading__', 'REAL', 4),
 ('ISAT_Value_Add_Math', 'REAL', 4),
 ('ISAT_Value_Add_Read', 'REAL', 4),
 ('ISAT_Value_Add_Color_Math', 'TEXT', 4),
 ('ISAT_Value_Add_Color_Read', 'TEXT', 4),
 ('Students_Taking__Algebra__', 'TEXT', 4),
 ('Students_Passing__Algebra__', 'TEXT', 4),
 ('9th Grade EXPLORE (2009)', 'TEXT', 4),
 ('9th Grade EXPLORE (2010)', 'TEXT', 4),
 ('10th Grade PLAN (2009)', 'TEXT', 4),
 ('10th Grade PLAN (2010)', 'TEXT', 4),
 ('Net_Change_EXPLORE_and_PLAN', 'TEXT', 4),
 ('11th Grade Average ACT (2011)', 'TEXT', 4),
 ('Net_Change_PLAN_and_ACT', 'TEXT', 4),
 ('College_Eligibility__', 'TEXT', 4),
 ('Graduation_Rate__', 'TEXT', 4),
 ('College_Enrollment_Rate__', 'TEXT', 4),
 ('COLLEGE_ENROLLMENT', 'INTEGER', 7),
 ('General_Services_Route', 'INTEGER', 7),
 ('Freshman_on_Track_Rate__', 'TEXT', 4),
 ('X_COORDINATE', 'REAL', 4),
 ('Y_COORDINATE', 'REAL', 4),
 ('Latitude', 'REAL', 4),
 ('Longitude', 'REAL', 4),
 ('COMMUNITY_AREA_NUMBER', 'INTEGER', 7),
 ('COMMUNITY_AREA_NAME', 'TEXT', 4),
 ('Ward', 'INTEGER', 7),
 ('Police_District', 'INTEGER', 7),
 ('Location', 'TEXT', 4)]

How many Elementary Schools are in the dataset?

In [11]:
%sql select count(*) from chicago_public_schools where "Elementary, Middle, or High School"='ES';

 * sqlite:///FinalDB.db
Done.

[(462,)]

What is the highest Safety Score?

In [12]:
%sql select max(safety_score) from chicago_public_schools;

 * sqlite:///FinalDB.db
Done.

[(99.0,)]

Which schools have highest Safety Score?

In [13]:
%sql select name_of_school from chicago_public_schools \
    where safety_score = (select max(safety_score) from chicago_public_schools);

 * sqlite:///FinalDB.db
Done.

[('Abraham Lincoln Elementary School',),
 ('Alexander Graham Bell Elementary School',),
 ('Annie Keller Elementary Gifted Magnet School',),
 ('Augustus H Burley Elementary School',),
 ('Edgar Allan Poe Elementary Classical School',),
 ('Edgebrook Elementary School',),
 ('Ellen Mitchell Elementary School',),
 ('James E McDade Elementary Classical School',),
 ('James G Blaine Elementary School',),
 ('LaSalle Elementary Language Academy',),
 ('Mary E Courtenay Elementary Language Arts Center',),
 ('Northside College Preparatory High School',),
 ('Northside Learning Center High School',),
 ('Norwood Park Elementary School',),
 ('Oriole Park Elementary School',),
 ('Sauganash Elementary School',),
 ('Stephen Decatur Classical Elementary School',),
 ('Talman Elementary School',),
 ('Wildwood Elementary School',)]

What are the top 10 schools with the highest "Average Student Attendance"?

In [14]:
%sql select name_of_school, average_student_attendance from chicago_public_schools \
    order by average_student_attendance desc nulls last limit 10;

 * sqlite:///FinalDB.db
Done.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [15]:
%sql select name_of_school, average_student_attendance from chicago_public_schools \
    order by average_student_attendance limit 5;

 * sqlite:///FinalDB.db
Done.

[('Velma F Thomas Early Childhood Center', None),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%')]

Now remove the '%' sign from the above result set for Average Student Attendance column

In [16]:
%sql select name_of_school, replace(average_student_attendance,'%','') as AverageStudentAttendance from chicago_public_schools \
    order by average_student_attendance limit 5;

 * sqlite:///FinalDB.db
Done.

[('Velma F Thomas Early Childhood Center', None),
 ('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00')]

Which Schools have the Average Student Attendance lower than 70%?

In [17]:
%sql select name_of_school, average_student_attendance from chicago_public_schools \
    where cast(replace(average_student_attendance,'%','') as double) < 70 \
        order by average_student_attendance;

 * sqlite:///FinalDB.db
Done.

[('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Orr Academy High School', '66.30%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Roberto Clemente Community Academy High School', '69.60%')]

Get the total College Enrollment for each Community Area.

In [18]:
%sql select community_area_name, sum(college_enrollment) as TOTAL_ENROLLMENT \
    from chicago_public_schools \
        group by community_area_name;

 * sqlite:///FinalDB.db
Done.

[('ALBANY PARK', 6864),
 ('ARCHER HEIGHTS', 4823),
 ('ARMOUR SQUARE', 1458),
 ('ASHBURN', 6483),
 ('AUBURN GRESHAM', 4175),
 ('AUSTIN', 10933),
 ('AVALON PARK', 1522),
 ('AVONDALE', 3640),
 ('BELMONT CRAGIN', 14386),
 ('BEVERLY', 1636),
 ('BRIDGEPORT', 3167),
 ('BRIGHTON PARK', 9647),
 ('BURNSIDE', 549),
 ('CALUMET HEIGHTS', 1568),
 ('CHATHAM', 5042),
 ('CHICAGO LAWN', 7086),
 ('CLEARING', 2085),
 ('DOUGLAS', 4670),
 ('DUNNING', 4568),
 ('EAST GARFIELD PARK', 5337),
 ('EAST SIDE', 5305),
 ('EDGEWATER', 4600),
 ('EDISON PARK', 910),
 ('ENGLEWOOD', 6832),
 ('FOREST GLEN', 1431),
 ('FULLER PARK', 531),
 ('GAGE PARK', 9915),
 ('GARFIELD RIDGE', 4552),
 ('GRAND BOULEVARD', 2809),
 ('GREATER GRAND CROSSING', 4051),
 ('HEGEWISCH', 963),
 ('HERMOSA', 3975),
 ('HUMBOLDT PARK', 8620),
 ('HYDE PARK', 1930),
 ('IRVING PARK', 7764),
 ('JEFFERSON PARK', 1755),
 ('KENWOOD', 4287),
 ('LAKE VIEW', 7055),
 ('LINCOLN PARK', 5615),
 ('LINCOLN SQUARE', 4132),
 ('LOGAN SQUARE', 7351),
 ('LOOP', 871),
 ('LOWER WEST SIDE', 7257),
 ('MCKINLEY PARK', 1552),
 ('MONTCLARE', 1317),
 ('MORGAN PARK', 3271),
 ('MOUNT GREENWOOD', 2091),
 ('NEAR NORTH SIDE', 3362),
 ('NEAR SOUTH SIDE', 1378),
 ('NEAR WEST SIDE', 7975),
 ('NEW CITY', 7922),
 ('NORTH CENTER', 7541),
 ('NORTH LAWNDALE', 5146),
 ('NORTH PARK', 4210),
 ('NORWOOD PARK', 6469),
 ('OAKLAND', 140),
 ('OHARE', 786),
 ('PORTAGE PARK', 6954),
 ('PULLMAN', 1620),
 ('RIVERDALE', 1547),
 ('ROGERS PARK', 4068),
 ('ROSELAND', 7020),
 ('SOUTH CHICAGO', 4043),
 ('SOUTH DEERING', 1859),
 ('SOUTH LAWNDALE', 14793),
 ('SOUTH SHORE', 4543),
 ('UPTOWN', 4388),
 ('WASHINGTON HEIGHTS', 4006),
 ('WASHINGTON PARK', 2648),
 ('WEST ELSDON', 3700),
 ('WEST ENGLEWOOD', 5946),
 ('WEST GARFIELD PARK', 2622),
 ('WEST LAWN', 4207),
 ('WEST PULLMAN', 3240),
 ('WEST RIDGE', 8197),
 ('WEST TOWN', 9429),
 ('WOODLAWN', 4206)]

Get the 5 Community Area with the least total College Enrollment sorted in ascending order.

In [19]:
%sql select community_area_name, sum(college_enrollment) as TOTAL_ENROLLMENT \
    from chicago_public_schools \
        group by community_area_name \
            order by TOTAL_ENROLLMENT limit 5;

 * sqlite:///FinalDB.db
Done.

[('OAKLAND', 140),
 ('FULLER PARK', 531),
 ('BURNSIDE', 549),
 ('OHARE', 786),
 ('LOOP', 871)]

List 5 schools with lowest safety score.

In [20]:
%sql select name_of_school, safety_score from chicago_public_schools \
    where safety_score != 'NONE' order by safety_score limit 5;

 * sqlite:///FinalDB.db
Done.

[('Edmond Burke Elementary School', 1.0),
 ("Luke O'Toole Elementary School", 5.0),
 ('George W Tilton Elementary School', 6.0),
 ('Foster Park Elementary School', 11.0),
 ('Emil G Hirsch Metropolitan High School', 13.0)]

Get hardship index for the community area which has the highest value for College Enrollment of 4368.

In [21]:
%sql select hardship_index from census_data CD, chicago_public_schools CPS \
    where CD.community_area_number = CPS.community_area_number \
        and college_enrollment = 4368;

 * sqlite:///FinalDB.db
Done.

[(6.0,)]

Get hardship index for the community area which has the highest value of College Enrollment.

In [22]:
%sql select community_area_name, community_area_number, hardship_index from census_data \
    where community_area_number in \
        (select community_area_number from chicago_public_schools order by college_enrollment desc limit 1);

 * sqlite:///FinalDB.db
Done.

[('North Center', 5.0, 6.0)]

Find the total number of crimes recorded in the CRIME table.

In [23]:
%sql select count(*) as total_crime from chicago_crime_data;

 * sqlite:///FinalDB.db
Done.

[(533,)]

List community area names and numbers with per capita income less than 11000.

In [24]:
%sql select community_area_name, community_area_number from census_data \
    where per_capita_income < 11000;

 * sqlite:///FinalDB.db
Done.

[('West Garfield Park', 26.0),
 ('South Lawndale', 30.0),
 ('Fuller Park', 37.0),
 ('Riverdale', 54.0)]

List all case numbers involving minors? (children are not considered minors for the purposes of crime analysis)

In [25]:
%sql select distinct case_number from chicago_crime_data \
    where description like "%MINOR%";

 * sqlite:///FinalDB.db
Done.

[('HL266884',), ('HK238408',)]

List all kidnapping crimes involving a child?

In [26]:
%sql select * from chicago_crime_data \
    where primary_type = 'KIDNAPPING' and description like "%CHILD%";

 * sqlite:///FinalDB.db
Done.

[(5276766, 'HN144152', '2007-01-26', '050XX W VAN BUREN ST', '1792', 'KIDNAPPING', 'CHILD ABDUCTION/STRANGER', 'STREET', 0, 0, 1533, 15, 29.0, 25.0, '20', 1143050.0, 1897546.0, 2007, 41.87490841, -87.75024931, '(41.874908413, -87.750249307)')]

List the kind of crimes that were recorded at schools. (No repetitions)

In [27]:
%sql select distinct primary_type from chicago_crime_data \
    where location_description like "%school%";

 * sqlite:///FinalDB.db
Done.

[('BATTERY',),
 ('CRIMINAL DAMAGE',),
 ('NARCOTICS',),
 ('ASSAULT',),
 ('CRIMINAL TRESPASS',),
 ('PUBLIC PEACE VIOLATION',)]

List the type of schools along with the average safety score for each type.

In [28]:
%sql select `Elementary, Middle, or High School`, avg(safety_score) as Average_Safety_Score \
    from chicago_public_schools \
        group by `Elementary, Middle, or High School`;

 * sqlite:///FinalDB.db
Done.

[('ES', 49.52038369304557), ('HS', 49.62352941176471), ('MS', 48.0)]

List 5 community areas with highest % of households below poverty line.

In [29]:
%sql select community_area_name from census_data \
    order by percent_households_below_poverty desc limit 5;

 * sqlite:///FinalDB.db
Done.

[('Riverdale',),
 ('Fuller Park',),
 ('Englewood',),
 ('North Lawndale',),
 ('East Garfield Park',)]

Which community area is most crime prone? Display the community area number only.

In [30]:
%sql select community_area_number from chicago_crime_data \
    group by community_area_number \
        order by count(*) desc limit 1;

 * sqlite:///FinalDB.db
Done.

[(25.0,)]

Use a sub-query to find the name of the community area with highest hardship index.

In [31]:
%sql select community_area_name from census_data \
    where hardship_index in (select max(hardship_index) from census_data);

 * sqlite:///FinalDB.db
Done.

[('Riverdale',)]

Use a sub-query to determine the Community Area Name with the most number of crimes?

In [32]:
%sql select community_area_name from census_data \
    where community_area_number = (select community_area_number from chicago_crime_data \
    group by community_area_number \
        order by count(*) desc limit 1);

 * sqlite:///FinalDB.db
Done.

[('Austin',)]

In [33]:
conn.commit()
conn.close()